Repository: hib4/pan-sea-ai-developer-challenge-2025
Catalog: mobile/lib/l10n/arb/app_*.arb
Languages: id

# onboardingTitleFirst1
source: Let's Start
id: Mari Mulai

# onboardingTitleFirst2
source: Your Story!
id: Cerita Kamu!

# onboardingSubtitleFirst
source: In Kanca, you can create your own exciting stories, learn good values, and practice kindness—all while playing!
id: Di Kanca, kamu bisa membuat cerita seru, belajar nilai kebaikan, dan berlatih bersikap baik—sambil bermain!

# onboardingTitleSecond1
source: Choose
id: Pilih

# onboardingTitleSecond2
source: Your Story Path,
id: Jalur Ceritamu,

# onboardingTitleSecond3
source: Learn the Lesson!
id: Ambil Pelajarannya!

# onboardingSubtitleSecond
source: The ending depends on your choices! Learn honesty, responsibility, and empathy in a fun & interactive way.
id: Akhir cerita tergantung pada pilihanmu! Belajar jujur, bertanggung jawab, dan berempati dengan cara yang seru & interaktif.

# onboardingTitleThird1
source: Create Moments,
id: Ciptakan Momen,

# onboardingTitleThird2
source: Build Character
id: Bangun Karakter

# onboardingSubtitleThird
source: With Kanca, learning becomes a meaningful journey toward a wise, caring, and respectful future.
id: Dengan Kanca, belajar menjadi perjalanan bermakna menuju masa depan yang bijak, peduli, dan penuh hormat.

# skipButton
source: Skip
id: Lewati

# nextButton
source: Next
id: Lanjut

# letsStartButton
source: Let's Start!
id: Mulai Sekarang!

# onboardingLoading1
source: Did you know? That...
id: Tahukah kamu? Bahwa...

# onboardingLoading2
source: your choices can make the story extraordinary.
id: pilihanmu bisa membuat cerita menjadi luar biasa.

# onboardingLoading3
source: Come on, let's start this exciting adventure!
id: Ayo, mari mulai petualangan seru ini!

# loginTitle
source: LOGIN
id: MASUK

# emailLabel
source: example@mail.com
id: contoh@mail.com

# passwordText
source: Password
id: Kata Sandi

# passwordLabel
source: Enter your password
id: Masukkan kata sandi kamu

# confirmPasswordText
source: Confirm Password
id: Konfirmasi Kata Sandi

# confirmPasswordLabel
source: Re-enter your password
id: Masukkan ulang kata sandi

# forgotPasswordText
source: Forgot Password?
id: Lupa Kata Sandi?

# continueButton
source: Continue
id: Lanjutkan

# orText
source: or
id: atau

# continueWithGoogleButton
source: Continue with Google
id: Lanjutkan dengan Google

# dontHaveAccountText
source: Don't have an account?
id: Belum punya akun?

# signUpNowText
source: Sign Up now!
id: Daftar sekarang!

# ruleText1
source: By using Kanca, you agree to our
id: Dengan menggunakan Kanca, kamu menyetujui

# ruleText2
source: Terms of Service
id: Ketentuan Layanan

# ruleText3
source: and
id: dan

# ruleText4
source: Privacy Policy
id: Kebijakan Privasi

# registerTitle
source: REGISTER
id: DAFTAR

# startNowButton
source: Start Now!
id: Mulai Sekarang!

# alreadyHaveAccountText
source: Already have an account?
id: Sudah punya akun?

# loginNowText
source: Login now!
id: Masuk sekarang!

# forgotPasswordTitle
source: FORGOT PASSWORD
id: LUPA KATA SANDI

# dontWorryText
source: Don't worry! It happens. Please enter the email address associated with your account.
id: Jangan khawatir! Itu wajar. Masukkan alamat email yang terhubung dengan akunmu.

# checkYourEmailText
source: Check your email
id: Periksa email kamu

# weHaveSentText
source: We have sent a password reset link to
id: Kami telah mengirimkan tautan reset kata sandi ke

# didntReceiveText
source: Didn't receive the email? Resend
id: Tidak menerima email? Kirim ulang

# sendResetLinkButton
source: Send Reset Link
id: Kirim Tautan Reset

# rememberYourPasswordText
source: Remember your password?
id: Ingat kata sandi kamu?

# backToLoginText
source: Back to Login
id: Kembali ke Masuk

# bottomNavHomeTitle
source: Home
id: Beranda

# bottomNavAchievementTitle
source: Achievement
id: Pencapaian

# bottomNavProgressTitle
source: Progress
id: Progres

# bottomNavProfileTitle
source: Profile
id: Profil

# playButton
source: Play
id: Mulai

# letsCreateTitle
source: Let's Create
id: Ayo Ciptakan

# yourStoryTitle
source: Your Story!
id: Ceritamu!

# typeStoryLabel
source: Type your story idea here...
id: Tulis ide cerita di sini...

# orChooseStoryText
source: Or Choose a Story Idea:
id: Atau Pilih Ide Cerita:

# storyIdeaSchool
source: School
id: Sekolah

# storyIdeaFantasy
source: Fantasy
id: Fantasi

# storyIdeaShopping
source: Shopping
id: Belanja

# storyIdeaExplore
source: Explore
id: Jelajah

# moralValueText
source: Moral Value:
id: Nilai Moral:

# moralValueSaving
source: Saving
id: Hemat

# moralValueHonesty
source: Honesty
id: Kejujuran

# moralValueWisdom
source: Wisdom
id: Kebijaksanaan

# moralValueSharing
source: Sharing
id: Berbagi

# createStoryButton
source: Create Story Now!
id: Buat Cerita Sekarang!

# storyLoadingTitle1
source: Please wait...
id: Mohon tunggu...

# storyLoadingTitle2
source: Get ready for an exciting adventure!
id: Bersiaplah untuk petualangan seru!

# storyLoadingSubtitle
source: Your personalized story is being crafted with care ✨
id: Ceritamu sedang dibuat dengan sepenuh hati ✨

# storyLoadingCaption1
source: Creating your magical story...
id: Menciptakan cerita magis kamu...

# storyLoadingCaption2
source: Generating beautiful illustrations...
id: Membuat ilustrasi indah...

# storyLoadingCaption3
source: Adding voice narration...
id: Menambahkan narasi suara...

# storyLoadingCaption4
source: Crafting moral lessons...
id: Menyusun pelajaran moral...

# storyLoadingCaption5
source: Building interactive choices...
id: Membangun pilihan interaktif...

# storyLoadingCaption6
source: Polishing your adventure...
id: Memoles petualanganmu...

# storyLoadingCaption7
source: Almost ready for you!
id: Hampir siap untukmu!

# storyLoadingCaption8
source: Adding final touches...
id: Menambahkan sentuhan akhir...

# storyLoadingCaption9
source: Preparing your journey...
id: Menyiapkan perjalananmu...

# storyLoadingCaption10
source: Making it perfect...
id: Membuatnya sempurna...

# storyLoadingCaption11
source: Just a few more seconds...
id: Tinggal beberapa detik lagi...

# startAdventureButton
source: Start Adventure
id: Mulai Petualangan

# coreValueTitle
source: Core Value
id: Nilai Inti

# meaningTitle
source: Meaning
id: Makna

# reallifeTitle
source: Real-life Example
id: Contoh Nyata

# homeButton
source: Home
id: Beranda

# newStoryButton
source: New Story
id: Cerita Baru
